posts/2021-01-30-c++-note.org
#+title: c++ note
#+date: <2021-01-30 15:08>
#+filetags: c++
#+OPTIONS: ^:nil

#+begin_comment
;;; cpp.org --- c/cpp programming language notes

;;; Commentary:
;;  It's a personal note.
;;  Written by (c) ZHONG Ming.  2020-2021.
#+end_comment

* grammar
** static
*** copy constructor
在使用包含静态成员的类时，有时候会调用拷贝构造函数生成临时的隐藏的类对象，
而这个临时对象在消亡时会调用析构函数有可能会对静态变量做操作（例如total_num--），
可是这些对象在生成时却没有执行构造函数中的total_num++的操作。
解决方案是为这个类写一个拷贝构造函数，在该拷贝构造函数中完成total_num++的操作。

** virtual
在构造函数和析构函数中调用虚的成员函数不会有虚函数的效果，即还是调用父类的成员函数。
可以使用工厂模式来解决。

类中有虚函数时，析构函数要为虚或者protected

** lvalue and rvalue
*** rvalue
rvalue: xvalue(Expiring Value), prvalue(Pure Right Value)

rvo, nrvo: Return Value Optimization, Named Return Value Optimization

编译器减少函数返回时生成临时值（对象）的个数
编译器默认使用，编译时使用 -fno-elide-constructors 来禁用
*** std::forward
defined in header <utility>

完美转发 能转发：
const T &
T &
const T &&
T &&

如果外面传来了rvalue临时变量，它就转发rvalue并且启用move语义
如果外面传来了lvalue，它就转发lvalue并且启用copy
能保留const，可以被static_cast替代

** cast
*** const_cast
可 cast const 的对象，除function pointers
*** static_cast 
*** reinterpret_cast
*** dynamic_cast

** smart pointer
*** unique_ptr
get()

release()
*** shared_ptr
*** weak_ptr
lock()

expired()
*** enable_shared_from_this 
Curiously Recurring Template Pattern 奇异递归模板模式是C++模板编程时的一种惯用法（idiom）
更一般地被称作F-bound polymorphism

shared_from_this: returns a shared_ptr which shares ownership of *this

weak_from_this: returns the weak_ptr which shares ownership of *this
#+begin_src c++
#include <memory>
#include <iostream>
 
struct Good: std::enable_shared_from_this<Good> // note: public inheritance
{
    std::shared_ptr<Good> getptr() {
        return shared_from_this();
    }
};
 
struct Bad
{
    std::shared_ptr<Bad> getptr() {
        return std::shared_ptr<Bad>(this);
    }
    ~Bad() { std::cout << "Bad::~Bad() called\n"; }
};
 
int main()
{
    // Good: the two shared_ptr's share the same object
    std::shared_ptr<Good> gp1 = std::make_shared<Good>();
    std::shared_ptr<Good> gp2 = gp1->getptr();
    std::cout << "gp2.use_count() = " << gp2.use_count() << '\n';
 
    // Bad: shared_from_this is called without having std::shared_ptr owning the caller 
    try {
        Good not_so_good;
        std::shared_ptr<Good> gp1 = not_so_good.getptr();
    } catch(std::bad_weak_ptr& e) {
        // undefined behavior (until C++17) and std::bad_weak_ptr thrown (since C++17)
        std::cout << e.what() << '\n';    
    }
 
    // Bad, each shared_ptr thinks it's the only owner of the object
    std::shared_ptr<Bad> bp1 = std::make_shared<Bad>();
    std::shared_ptr<Bad> bp2 = bp1->getptr();
    std::cout << "bp2.use_count() = " << bp2.use_count() << '\n';
} // UB: double-delete of Bad

#+end_src

* std container
** std::array
template<typename T, size_t N>

内存分配在栈（stack）上，不会重新分配，随机访问元素

swap: 交换每一个元素

fill: 对所有元素赋值

** std::vector
template<typename T, typename Allocator = allocator<T> >

assign: 赋值

capacity: 容量

reserve: 预先分配内存

shrink_to_fit: resize到合适的内存大小

push_back, emplace_back: 尾部插入

insert，emplace: 插入

vector的元素不能为bool

** std::deque
acronym of double-ended queue 双端队列

push_front, emplace_front: 头部插入

** std::list
Doubly linked list 双向列表

remove, remove_if: 删除

reverse: 反转

sort: 排序

merge: 合并已排序的list

unique: 已排序的list去重

splice: 接合

** std::forward_list
Single linked list 单向列表

before_begin: begin的前一个迭代器

erase_after: 删除下一个元素，返回 void

insert_after: 插入

splice_after: 接合

