2021-01-30-c++-note.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="UTF-8">
<link rel="alternate"
      type="application/rss+xml"
      href="https://zhongming-unice.github.io/rss.xml"
      title="RSS feed for https://zhongming-unice.github.io/"/>
<title>c++ note</title>
<meta name="author" content="ming"><meta name="referrer" content="no-referrer"><link href="static/usual-org-front-matter.css" rel="stylesheet" type="text/css" /><link href="static/org-notes-style.css" rel="stylesheet" type="text/css" /><link href="static/floating-toc.css" rel="stylesheet" type="text/css" /><link href="static/blog-banner.css" rel="stylesheet" type="text/css" /><link rel="icon" href="static/favicon.ico"></head>
<body>
<div id="preamble" class="status">
<div class="header">  <div class="sitelinks">    <a href="https://zhongming-unice.github.io/about.html">about</a>    | <a href="https://zhongming-unice.github.io/archive.html">archive</a>    | <a href="https://zhongming-unice.github.io/rss.xml">rss</a>  </div></div></div>
<div id="content">
<div class="post-date">30  1 2021</div><h1 class="post-title"><a href="https://zhongming-unice.github.io/2021-01-30-c++-note.html">c++ note</a></h1>
<nav id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgfc7d322">1. grammar</a>
<ul>
<li><a href="#org98afcb3">1.1. static</a>
<ul>
<li><a href="#org3c59a04">1.1.1. copy constructor</a></li>
</ul>
</li>
<li><a href="#orgcda55dd">1.2. virtual</a></li>
<li><a href="#org0b953fd">1.3. lvalue and rvalue</a>
<ul>
<li><a href="#orgf56ae57">1.3.1. rvalue</a></li>
<li><a href="#org54861fe">1.3.2. std::forward</a></li>
</ul>
</li>
<li><a href="#orge07acd5">1.4. cast</a>
<ul>
<li><a href="#org352b6c4">1.4.1. const_cast</a></li>
<li><a href="#org996452d">1.4.2. static_cast</a></li>
<li><a href="#org58c98ad">1.4.3. reinterpret_cast</a></li>
<li><a href="#org46cbd69">1.4.4. dynamic_cast</a></li>
</ul>
</li>
<li><a href="#org11964b4">1.5. smart pointer</a>
<ul>
<li><a href="#orgb0635bc">1.5.1. unique_ptr</a></li>
<li><a href="#org731a621">1.5.2. shared_ptr</a></li>
<li><a href="#orgcc31c0a">1.5.3. weak_ptr</a></li>
<li><a href="#org8ad1c89">1.5.4. enable_shared_from_this</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org22e1b30">2. std container</a>
<ul>
<li><a href="#orgcab0734">2.1. std::array</a></li>
<li><a href="#org15582ed">2.2. std::vector</a></li>
<li><a href="#org1c233d1">2.3. std::deque</a></li>
<li><a href="#orgb0e3f90">2.4. std::list</a></li>
<li><a href="#orgd73bcb9">2.5. std::forward_list</a></li>
<li><a href="#org19c52f3">2.6. std::set</a></li>
<li><a href="#org3b16623">2.7. std::map</a></li>
<li><a href="#orgd6fc2df">2.8. std::unordered_map</a></li>
</ul>
</li>
<li><a href="#orgdf3bbd7">3. multithread</a>
<ul>
<li><a href="#orgdd3859d">3.1. basic</a></li>
<li><a href="#orgfa52d23">3.2. atomic</a>
<ul>
<li><a href="#org6a8929d">3.2.1. some operators</a></li>
<li><a href="#org7369849">3.2.2. memory order</a></li>
<li><a href="#orgdff6edf">3.2.3. atomic_flag</a></li>
</ul>
</li>
<li><a href="#org090190a">3.3. mutex</a>
<ul>
<li><a href="#org1f939d3">3.3.1. RAII</a></li>
<li><a href="#org1976838">3.3.2. lock_guard, unique_lock and scoped_lock</a></li>
</ul>
</li>
<li><a href="#org5469694">3.4. condition_variable</a></li>
</ul>
</li>
<li><a href="#org3006216">4. complier</a>
<ul>
<li><a href="#org5d5b9fd">4.1. install clang-12</a></li>
<li><a href="#org43f5fd0">4.2. install gcc-10</a></li>
<li><a href="#org84a6024">4.3. gcc</a></li>
</ul>
</li>
<li><a href="#org733aecc">5. gdb</a></li>
<li><a href="#org8f6c997">6. miscellaneous</a>
<ul>
<li><a href="#orgd1451a5">6.1. value semantics</a></li>
</ul>
</li>
<li><a href="#org328459a">7. design patterns</a>
<ul>
<li><a href="#org47eb07f">7.1. creational patterns</a>
<ul>
<li><a href="#orgc825713">7.1.1. abstract factory</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org1f95517">8. Primer C++</a>
<ul>
<li><a href="#org9f1fb5f">8.1. string, vector and array</a></li>
</ul>
</li>
<li><a href="#org7f2f410">9. CSAPP</a>
<ul>
<li><a href="#org9541bd9">9.1. basic</a>
<ul>
<li><a href="#orga4fb1f3">9.1.1. array and pointer</a></li>
<li><a href="#orgad4a9d8">9.1.2. registers</a></li>
<li><a href="#org5cb5356">9.1.3. overflow buffer</a></li>
</ul>
</li>
<li><a href="#orgff83253">9.2. asm</a>
<ul>
<li><a href="#orgc8c1ad6">9.2.1. conditional move</a></li>
</ul>
</li>
<li><a href="#org6b34733">9.3. lab</a>
<ul>
<li><a href="#org7a16a5c">9.3.1. data lab</a></li>
<li><a href="#org9aa0df3">9.3.2. bomb lab</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgb67a3da">10. Practical Network Programming</a>
<ul>
<li><a href="#org3ffb5c8">10.1. intro</a>
<ul>
<li><a href="#orgf2a2faa">10.1.1. layered network</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org8779366">11. UNIX Network Programming</a></li>
</ul>
</div>
</nav>

<div id="outline-container-orgfc7d322" class="outline-2">
<h2 id="orgfc7d322"><span class="section-number-2">1</span> grammar</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org98afcb3" class="outline-3">
<h3 id="org98afcb3"><span class="section-number-3">1.1</span> static</h3>
<div class="outline-text-3" id="text-1-1">
</div>
<div id="outline-container-org3c59a04" class="outline-4">
<h4 id="org3c59a04"><span class="section-number-4">1.1.1</span> copy constructor</h4>
<div class="outline-text-4" id="text-1-1-1">
<p>
在使用包含静态成员的类时，有时候会调用拷贝构造函数生成临时的隐藏的类对象，
而这个临时对象在消亡时会调用析构函数有可能会对静态变量做操作（例如total_num&#x2013;），
可是这些对象在生成时却没有执行构造函数中的total_num++的操作。
解决方案是为这个类写一个拷贝构造函数，在该拷贝构造函数中完成total_num++的操作。
</p>
</div>
</div>
</div>

<div id="outline-container-orgcda55dd" class="outline-3">
<h3 id="orgcda55dd"><span class="section-number-3">1.2</span> virtual</h3>
<div class="outline-text-3" id="text-1-2">
<p>
在构造函数和析构函数中调用虚的成员函数不会有虚函数的效果，即还是调用父类的成员函数。
可以使用工厂模式来解决。
</p>

<p>
类中有虚函数时，析构函数要为虚或者protected
</p>
</div>
</div>

<div id="outline-container-org0b953fd" class="outline-3">
<h3 id="org0b953fd"><span class="section-number-3">1.3</span> lvalue and rvalue</h3>
<div class="outline-text-3" id="text-1-3">
</div>
<div id="outline-container-orgf56ae57" class="outline-4">
<h4 id="orgf56ae57"><span class="section-number-4">1.3.1</span> rvalue</h4>
<div class="outline-text-4" id="text-1-3-1">
<p>
rvalue: xvalue(Expiring Value), prvalue(Pure Right Value)
</p>

<p>
rvo, nrvo: Return Value Optimization, Named Return Value Optimization
</p>

<p>
编译器减少函数返回时生成临时值（对象）的个数
编译器默认使用，编译时使用 -fno-elide-constructors 来禁用
</p>
</div>
</div>
<div id="outline-container-org54861fe" class="outline-4">
<h4 id="org54861fe"><span class="section-number-4">1.3.2</span> std::forward</h4>
<div class="outline-text-4" id="text-1-3-2">
<p>
defined in header &lt;utility&gt;
</p>

<p>
完美转发 能转发：
const T &amp;
T &amp;
const T &amp;&amp;
T &amp;&amp;
</p>

<p>
如果外面传来了rvalue临时变量，它就转发rvalue并且启用move语义
如果外面传来了lvalue，它就转发lvalue并且启用copy
能保留const，可以被static_cast替代
</p>
</div>
</div>
</div>

<div id="outline-container-orge07acd5" class="outline-3">
<h3 id="orge07acd5"><span class="section-number-3">1.4</span> cast</h3>
<div class="outline-text-3" id="text-1-4">
</div>
<div id="outline-container-org352b6c4" class="outline-4">
<h4 id="org352b6c4"><span class="section-number-4">1.4.1</span> const_cast</h4>
<div class="outline-text-4" id="text-1-4-1">
<p>
可 cast const 的对象，除function pointers
</p>
</div>
</div>
<div id="outline-container-org996452d" class="outline-4">
<h4 id="org996452d"><span class="section-number-4">1.4.2</span> static_cast</h4>
</div>
<div id="outline-container-org58c98ad" class="outline-4">
<h4 id="org58c98ad"><span class="section-number-4">1.4.3</span> reinterpret_cast</h4>
</div>
<div id="outline-container-org46cbd69" class="outline-4">
<h4 id="org46cbd69"><span class="section-number-4">1.4.4</span> dynamic_cast</h4>
</div>
</div>

<div id="outline-container-org11964b4" class="outline-3">
<h3 id="org11964b4"><span class="section-number-3">1.5</span> smart pointer</h3>
<div class="outline-text-3" id="text-1-5">
</div>
<div id="outline-container-orgb0635bc" class="outline-4">
<h4 id="orgb0635bc"><span class="section-number-4">1.5.1</span> unique_ptr</h4>
<div class="outline-text-4" id="text-1-5-1">
<p>
get()
</p>

<p>
release()
</p>
</div>
</div>
<div id="outline-container-org731a621" class="outline-4">
<h4 id="org731a621"><span class="section-number-4">1.5.2</span> shared_ptr</h4>
</div>
<div id="outline-container-orgcc31c0a" class="outline-4">
<h4 id="orgcc31c0a"><span class="section-number-4">1.5.3</span> weak_ptr</h4>
<div class="outline-text-4" id="text-1-5-3">
<p>
lock()
</p>

<p>
expired()
</p>
</div>
</div>
<div id="outline-container-org8ad1c89" class="outline-4">
<h4 id="org8ad1c89"><span class="section-number-4">1.5.4</span> enable_shared_from_this</h4>
<div class="outline-text-4" id="text-1-5-4">
<p>
Curiously Recurring Template Pattern 奇异递归模板模式是C++模板编程时的一种惯用法（idiom）
更一般地被称作F-bound polymorphism
</p>

<p>
shared_from_this: returns a shared_ptr which shares ownership of *this
</p>

<p>
weak_from_this: returns the weak_ptr which shares ownership of *this
</p>
<div class="org-src-container">
<pre class="src src-c++">#include &lt;memory&gt;
#include &lt;iostream&gt;

struct Good: std::enable_shared_from_this&lt;Good&gt; // note: public inheritance
{
    std::shared_ptr&lt;Good&gt; getptr() {
	return shared_from_this();
    }
};

struct Bad
{
    std::shared_ptr&lt;Bad&gt; getptr() {
	return std::shared_ptr&lt;Bad&gt;(this);
    }
    ~Bad() { std::cout &lt;&lt; "Bad::~Bad() called\n"; }
};

int main()
{
    // Good: the two shared_ptr's share the same object
    std::shared_ptr&lt;Good&gt; gp1 = std::make_shared&lt;Good&gt;();
    std::shared_ptr&lt;Good&gt; gp2 = gp1-&gt;getptr();
    std::cout &lt;&lt; "gp2.use_count() = " &lt;&lt; gp2.use_count() &lt;&lt; '\n';

    // Bad: shared_from_this is called without having std::shared_ptr owning the caller 
    try {
	Good not_so_good;
	std::shared_ptr&lt;Good&gt; gp1 = not_so_good.getptr();
    } catch(std::bad_weak_ptr&amp; e) {
	// undefined behavior (until C++17) and std::bad_weak_ptr thrown (since C++17)
	std::cout &lt;&lt; e.what() &lt;&lt; '\n';    
    }

    // Bad, each shared_ptr thinks it's the only owner of the object
    std::shared_ptr&lt;Bad&gt; bp1 = std::make_shared&lt;Bad&gt;();
    std::shared_ptr&lt;Bad&gt; bp2 = bp1-&gt;getptr();
    std::cout &lt;&lt; "bp2.use_count() = " &lt;&lt; bp2.use_count() &lt;&lt; '\n';
} // UB: double-delete of Bad

</pre>
</div>
</div>
</div>
</div>
</div>

<div id="outline-container-org22e1b30" class="outline-2">
<h2 id="org22e1b30"><span class="section-number-2">2</span> std container</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-orgcab0734" class="outline-3">
<h3 id="orgcab0734"><span class="section-number-3">2.1</span> std::array</h3>
<div class="outline-text-3" id="text-2-1">
<p>
template&lt;typename T, size_t N&gt;
</p>

<p>
内存分配在栈（stack）上，不会重新分配，随机访问元素
</p>

<p>
swap: 交换每一个元素
</p>

<p>
fill: 对所有元素赋值
</p>
</div>
</div>

<div id="outline-container-org15582ed" class="outline-3">
<h3 id="org15582ed"><span class="section-number-3">2.2</span> std::vector</h3>
<div class="outline-text-3" id="text-2-2">
<p>
template&lt;typename T, typename Allocator = allocator&lt;T&gt; &gt;
</p>

<p>
assign: 赋值
</p>

<p>
capacity: 容量
</p>

<p>
reserve: 预先分配内存
</p>

<p>
shrink_to_fit: resize到合适的内存大小
</p>

<p>
push_back, emplace_back: 尾部插入
</p>

<p>
insert，emplace: 插入
</p>

<p>
vector的元素不能为bool
</p>
</div>
</div>

<div id="outline-container-org1c233d1" class="outline-3">
<h3 id="org1c233d1"><span class="section-number-3">2.3</span> std::deque</h3>
<div class="outline-text-3" id="text-2-3">
<p>
acronym of double-ended queue 双端队列
</p>

<p>
push_front, emplace_front: 头部插入
</p>
</div>
</div>

<div id="outline-container-orgb0e3f90" class="outline-3">
<h3 id="orgb0e3f90"><span class="section-number-3">2.4</span> std::list</h3>
<div class="outline-text-3" id="text-2-4">
<p>
Doubly linked list 双向列表
</p>

<p>
remove, remove_if: 删除
</p>

<p>
reverse: 反转
</p>

<p>
sort: 排序
</p>

<p>
merge: 合并已排序的list
</p>

<p>
unique: 已排序的list去重
</p>

<p>
splice: 接合
</p>
</div>
</div>

<div id="outline-container-orgd73bcb9" class="outline-3">
<h3 id="orgd73bcb9"><span class="section-number-3">2.5</span> std::forward_list</h3>
<div class="outline-text-3" id="text-2-5">
<p>
Single linked list 单向列表
</p>

<p>
before_begin: begin的前一个迭代器
</p>

<p>
erase_after: 删除下一个元素，返回 void
</p>

<p>
insert_after: 插入
</p>

<p>
splice_after: 接合
</p>
</div>
</div>
