posts/2021-01-30-c++-note.org
** std::set
template<typename T, typename Compare = less<T>, typename Allocator = allocator<T>>

count: 查找元素个数

find: 查找元素

lower_bound: 第一个可插入点

upper_bound: 最后一个可插入点

equal_range: pair(lower_bound, upper_bound)

insert: 插入，返回值为pair<Iterator, bool>

std::find: 根据operator==查找；而std::set::find 根据Compare查找

std::set::find 比 std::find 快

** std::map
template<typename Key, typename T, typename Compare = less<Key>, typename Allocator = allocator<pair<const Key, T> > >

find: 返回pair<const Key, T>

emplace_hint: 推荐插入

[] 和 .at()，[const Key] 不存在时插入pair，返回pair.second，.at(const Key) 不存在时不插入，返回一个异常

** std::unordered_map
template<typename Key, typename T, typename Hash = hash<Key>, typename EqPred = equal_to<Key>, typename Allocator = allocator<pair<const Key, T> > >

需要使用模板类的偏化定义键的 hash 函数，如果有两个值，可以使用 boost 库的 hash_combine

#+begin_src c++
  // Key class 's hash function
namespaece std
  {
    template<> struct hash<Key>	// Template Specialization 
    {
      size_t operator()(const Key &k) const
      {
	return k.value;
      }
    };
  }
 // if we need combine 2 values
template <class T>
inline void hash_combine(std::size_t& seed, const T& v)
{
  std::hash<T> hasher;
  seed ^= hasher(v) + 0x9e3779b9 + (seed<<6) + (seed>>2);
}

namespaece std
  {
    template<> struct hash<Key>	// Template Specialization 
    {
      size_t operator()(const Key &k) const
      {
	auto seed1 = hash<int>()(k.v1);
	return hash_combine(seed1, k.v2);
      }
    };
  }
#+end_src

* multithread
** basic
std::thread::hardware_concurrency 硬件支持的线程数

std::this_thread::yield() 让出时间片

** atomic
*** some operators

| 原子指令 (x均为std::atomic<int>)                 | 作用                                                               |
|--------------------------------------------------+--------------------------------------------------------------------|
| x.load()                                         | 返回x的值。                                                        |
| x.store(n)                                       | 把x设为n，什么都不返回。                                           |
| x.exchange(n)                                    | 把x设为n，返回设定之前的值。                                       |
| x.compare_exchange_strong(expected_ref, desired) | 若x等于expected_ref，则设为desired；否则把最新值写入expected_ref。 |
| x.compare_exchange_weak(expected_ref, desired)   | 相比compare_exchange_strong可能有spurious wakeup                   |
| x.fetch_add(n), x.fetch_sub(n)                   | 原子地做x += n, x-= n，返回修改之前的值。                          |

*** memory order
relaxed: 宽松内存顺序的典型使用是计数器自增，
例如 std::shared_ptr 的引用计数器，因为这只要求原子性，
但不要求顺序或同步（注意 std::shared_ptr 计数器自减要求与析构函数进行获得释放同步）

acquire: 若线程 A 中的一个原子存储带标签 memory_order_release ，
而线程 B 中来自同一变量的原子加载带标签 memory_order_acquire ，
则从线程 A 的视角先发生于原子存储的所有内存写入（非原子及宽松原子的），
在线程 B 中成为可见副效应，即一旦原子加载完成，则保证线程 B 能观察到线程 A 写入内存的所有内容。 
互斥锁（例如 std::mutex 或原子自旋锁）是释放获得同步的例子：线程 A 释放锁而线程 B 获得它时，
发生于线程 A 环境的临界区（释放之前）中的所有事件，必须对于执行同一临界区的线程 B （获得之后）可见。

consume: 若线程 A 中的原子存储带标签 memory_order_release ，
而线程 B 中来自同一对象的读取存储值的原子加载带标签 memory_order_consume ，
则线程 A 视角中先发生于原子存储的所有内存写入（非原子和宽松原子的），
会在线程 B 中该加载操作所携带依赖进入的操作中变成可见副效应，
即一旦完成原子加载，则保证线程B中，使用从该加载获得的值的运算符和函数，能见到线程 A 写入内存的内容。

| memory order         | 作用                                                                                     |
|----------------------+------------------------------------------------------------------------------------------|
| memory_order_relaxed | 没有fencing作用                                                                          |
| memory_order_consume | 后面依赖此原子变量的访存指令勿重排至此条指令之前                                         |
| memory_order_acquire | 后面访存指令勿重排至此条指令之前                                                         |
| memory_order_release | 前面访存指令勿重排至此条指令之后。当此条指令的结果对其他线程可见后，之前的所有指令都可见 |
| memory_order_acq_rel | acquire + release语意                                                                    |
| memory_order_seq_cst | acq_rel语意外加所有使用seq_cst的指令有严格地全序关系                                     |

限制重排：

Release-Acquire ordering: 在store()之前的所有读写操作，不允许被移动到这个store()的后面。
在load()之后的所有读写操作，不允许被移动到这个load()的前面。
假设 Thread-1 store()的那个值，成功被 Thread-2 load()到了，
那么 Thread-1 在store()之前对内存的所有写入操作，此时对 Thread-2 来说，都是可见的。

*** atomic_flag
可于用户空间用 atomic_flag 实现自旋互斥

互斥锁是是一种sleep-waiting的锁，自旋锁是一种busy-waiting的锁

** mutex
一般设为 mutable 使得const member function 可以使用
使用 std::lock_guard<std::mutex> 这种 RAII 防止出现异常导致 mutex 没有 unlock，

配合 std::lock 和 std::adopt_lock 可以防止死锁

lock_guard 提供便利的 RAII 机制

*** RAII
资源获取即初始化（Resource Acquisition Is Initialization），或称 RAII，
它将必须在使用前请求的资源的生命周期与一个对象的生命周期相绑定。

将每个资源封装入一个类，其中

1, 构造函数请求资源，并建立所有类不变式，或在它无法完成时抛出异常，

2, 析构函数释放资源并决不抛出异常；

始终经由 RAII 类的实例使用满足要求的资源，该资源

1, 自身拥有自动存储期或临时生存期，

2, 具有与自动或临时对象的生存期绑定的生存期

移动语义使得在对象间，跨作用域，以及在线程内外安全地移动所有权，而同时维护资源安全成为可能。

拥有 open()/close()、lock()/unlock()，或 init()/copyFrom()/destroy() 成员函数的类是非 RAII 类的典型的例子

*** lock_guard, unique_lock and scoped_lock
#+begin_src c++
std::scoped_lock lock(e1.m, e2.m);
 
// 等价代码 1 （用 std::lock 和 std::lock_guard ）
// std::lock(e1.m, e2.m);
// std::lock_guard<std::mutex> lk1(e1.m, std::adopt_lock);
// std::lock_guard<std::mutex> lk2(e2.m, std::adopt_lock);

// 等价代码 2 （若需要 unique_lock ，例如对于条件变量）
// std::unique_lock<std::mutex> lk1(e1.m, std::defer_lock);
// std::unique_lock<std::mutex> lk2(e2.m, std::defer_lock);
// std::lock(lk1, lk2);
#+end_src

** condition_variable
notify_one(): notifies one waiting thread

notify_all(): notifies all waiting threads

* complier
** install clang-12

https://apt.llvm.org/
#+begin_src sh
wget https://apt.llvm.org/llvm.sh
chmod +x llvm.sh
sudo ./llvm.sh <version number>
#+end_src sh
#+begin_src sh
sudo update-alternatives --config clang
cd /usr/bin
sudo ln -s clang-12 clang
sudo ln -s clang++-12 clang++
sudo ln -s /usr/bin/llvm-ar-12 /usr/bin/llvm-ar
sudo ln -s /usr/bin/llvm-as-12 /usr/bin/llvm-as
sudo ln -s /usr/bin/clangd-12 /usr/bin/clangd
sudo ln -s /usr/bin/clang-tidy-12 /usr/bin/clang-tidy

alias clang++='clang++ -std=c++20'
#+end_src

