2021-01-30-c++-note.html

<div id="outline-container-org19c52f3" class="outline-3">
<h3 id="org19c52f3"><span class="section-number-3">2.6</span> std::set</h3>
<div class="outline-text-3" id="text-2-6">
<p>
template&lt;typename T, typename Compare = less&lt;T&gt;, typename Allocator = allocator&lt;T&gt;&gt;
</p>

<p>
count: 查找元素个数
</p>

<p>
find: 查找元素
</p>

<p>
lower_bound: 第一个可插入点
</p>

<p>
upper_bound: 最后一个可插入点
</p>

<p>
equal_range: pair(lower_bound, upper_bound)
</p>

<p>
insert: 插入，返回值为pair&lt;Iterator, bool&gt;
</p>

<p>
std::find: 根据operator==查找；而std::set::find 根据Compare查找
</p>

<p>
std::set::find 比 std::find 快
</p>
</div>
</div>

<div id="outline-container-org3b16623" class="outline-3">
<h3 id="org3b16623"><span class="section-number-3">2.7</span> std::map</h3>
<div class="outline-text-3" id="text-2-7">
<p>
template&lt;typename Key, typename T, typename Compare = less&lt;Key&gt;, typename Allocator = allocator&lt;pair&lt;const Key, T&gt; &gt; &gt;
</p>

<p>
find: 返回pair&lt;const Key, T&gt;
</p>

<p>
emplace_hint: 推荐插入
</p>

<p>
[] 和 .at()，[const Key] 不存在时插入pair，返回pair.second，.at(const Key) 不存在时不插入，返回一个异常
</p>
</div>
</div>

<div id="outline-container-orgd6fc2df" class="outline-3">
<h3 id="orgd6fc2df"><span class="section-number-3">2.8</span> std::unordered_map</h3>
<div class="outline-text-3" id="text-2-8">
<p>
template&lt;typename Key, typename T, typename Hash = hash&lt;Key&gt;, typename EqPred = equal_to&lt;Key&gt;, typename Allocator = allocator&lt;pair&lt;const Key, T&gt; &gt; &gt;
</p>

<p>
需要使用模板类的偏化定义键的 hash 函数，如果有两个值，可以使用 boost 库的 hash_combine
</p>

<div class="org-src-container">
<pre class="src src-c++">  // Key class 's hash function
namespaece std
  {
    template&lt;&gt; struct hash&lt;Key&gt;	// Template Specialization 
    {
      size_t operator()(const Key &amp;k) const
      {
	return k.value;
      }
    };
  }
 // if we need combine 2 values
template &lt;class T&gt;
inline void hash_combine(std::size_t&amp; seed, const T&amp; v)
{
  std::hash&lt;T&gt; hasher;
  seed ^= hasher(v) + 0x9e3779b9 + (seed&lt;&lt;6) + (seed&gt;&gt;2);
}

namespaece std
  {
    template&lt;&gt; struct hash&lt;Key&gt;	// Template Specialization 
    {
      size_t operator()(const Key &amp;k) const
      {
	auto seed1 = hash&lt;int&gt;()(k.v1);
	return hash_combine(seed1, k.v2);
      }
    };
  }
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgdf3bbd7" class="outline-2">
<h2 id="orgdf3bbd7"><span class="section-number-2">3</span> multithread</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-orgdd3859d" class="outline-3">
<h3 id="orgdd3859d"><span class="section-number-3">3.1</span> basic</h3>
<div class="outline-text-3" id="text-3-1">
<p>
std::thread::hardware_concurrency 硬件支持的线程数
</p>

<p>
std::this_thread::yield() 让出时间片
</p>
</div>
</div>

<div id="outline-container-orgfa52d23" class="outline-3">
<h3 id="orgfa52d23"><span class="section-number-3">3.2</span> atomic</h3>
<div class="outline-text-3" id="text-3-2">
</div>
<div id="outline-container-org6a8929d" class="outline-4">
<h4 id="org6a8929d"><span class="section-number-4">3.2.1</span> some operators</h4>
<div class="outline-text-4" id="text-3-2-1">
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">原子指令 (x均为std::atomic&lt;int&gt;)</th>
<th scope="col" class="org-left">作用</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">x.load()</td>
<td class="org-left">返回x的值。</td>
</tr>

<tr>
<td class="org-left">x.store(n)</td>
<td class="org-left">把x设为n，什么都不返回。</td>
</tr>

<tr>
<td class="org-left">x.exchange(n)</td>
<td class="org-left">把x设为n，返回设定之前的值。</td>
</tr>

<tr>
<td class="org-left">x.compare_exchange_strong(expected_ref, desired)</td>
<td class="org-left">若x等于expected_ref，则设为desired；否则把最新值写入expected_ref。</td>
</tr>

<tr>
<td class="org-left">x.compare_exchange_weak(expected_ref, desired)</td>
<td class="org-left">相比compare_exchange_strong可能有spurious wakeup</td>
</tr>

<tr>
<td class="org-left">x.fetch_add(n), x.fetch_sub(n)</td>
<td class="org-left">原子地做x += n, x-= n，返回修改之前的值。</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org7369849" class="outline-4">
<h4 id="org7369849"><span class="section-number-4">3.2.2</span> memory order</h4>
<div class="outline-text-4" id="text-3-2-2">
<p>
relaxed: 宽松内存顺序的典型使用是计数器自增，
例如 std::shared_ptr 的引用计数器，因为这只要求原子性，
但不要求顺序或同步（注意 std::shared_ptr 计数器自减要求与析构函数进行获得释放同步）
</p>

<p>
acquire: 若线程 A 中的一个原子存储带标签 memory_order_release ，
而线程 B 中来自同一变量的原子加载带标签 memory_order_acquire ，
则从线程 A 的视角先发生于原子存储的所有内存写入（非原子及宽松原子的），
在线程 B 中成为可见副效应，即一旦原子加载完成，则保证线程 B 能观察到线程 A 写入内存的所有内容。 
互斥锁（例如 std::mutex 或原子自旋锁）是释放获得同步的例子：线程 A 释放锁而线程 B 获得它时，
发生于线程 A 环境的临界区（释放之前）中的所有事件，必须对于执行同一临界区的线程 B （获得之后）可见。
</p>

<p>
consume: 若线程 A 中的原子存储带标签 memory_order_release ，
而线程 B 中来自同一对象的读取存储值的原子加载带标签 memory_order_consume ，
则线程 A 视角中先发生于原子存储的所有内存写入（非原子和宽松原子的），
会在线程 B 中该加载操作所携带依赖进入的操作中变成可见副效应，
即一旦完成原子加载，则保证线程B中，使用从该加载获得的值的运算符和函数，能见到线程 A 写入内存的内容。
</p>

<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">memory order</th>
<th scope="col" class="org-left">作用</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">memory_order_relaxed</td>
<td class="org-left">没有fencing作用</td>
</tr>

<tr>
<td class="org-left">memory_order_consume</td>
<td class="org-left">后面依赖此原子变量的访存指令勿重排至此条指令之前</td>
</tr>

<tr>
<td class="org-left">memory_order_acquire</td>
<td class="org-left">后面访存指令勿重排至此条指令之前</td>
</tr>

<tr>
<td class="org-left">memory_order_release</td>
<td class="org-left">前面访存指令勿重排至此条指令之后。当此条指令的结果对其他线程可见后，之前的所有指令都可见</td>
</tr>

<tr>
<td class="org-left">memory_order_acq_rel</td>
<td class="org-left">acquire + release语意</td>
</tr>

<tr>
<td class="org-left">memory_order_seq_cst</td>
<td class="org-left">acq_rel语意外加所有使用seq_cst的指令有严格地全序关系</td>
</tr>
</tbody>
</table>

<p>
限制重排：
</p>

<p>
Release-Acquire ordering: 在store()之前的所有读写操作，不允许被移动到这个store()的后面。
在load()之后的所有读写操作，不允许被移动到这个load()的前面。
假设 Thread-1 store()的那个值，成功被 Thread-2 load()到了，
那么 Thread-1 在store()之前对内存的所有写入操作，此时对 Thread-2 来说，都是可见的。
</p>
</div>
</div>

<div id="outline-container-orgdff6edf" class="outline-4">
<h4 id="orgdff6edf"><span class="section-number-4">3.2.3</span> atomic_flag</h4>
<div class="outline-text-4" id="text-3-2-3">
<p>
可于用户空间用 atomic_flag 实现自旋互斥
</p>

<p>
互斥锁是是一种sleep-waiting的锁，自旋锁是一种busy-waiting的锁
</p>
</div>
</div>
</div>

<div id="outline-container-org090190a" class="outline-3">
<h3 id="org090190a"><span class="section-number-3">3.3</span> mutex</h3>
<div class="outline-text-3" id="text-3-3">
<p>
一般设为 mutable 使得const member function 可以使用
使用 std::lock_guard&lt;std::mutex&gt; 这种 RAII 防止出现异常导致 mutex 没有 unlock，
</p>

<p>
配合 std::lock 和 std::adopt_lock 可以防止死锁
</p>

<p>
lock_guard 提供便利的 RAII 机制
</p>
</div>

<div id="outline-container-org1f939d3" class="outline-4">
<h4 id="org1f939d3"><span class="section-number-4">3.3.1</span> RAII</h4>
<div class="outline-text-4" id="text-3-3-1">
<p>
资源获取即初始化（Resource Acquisition Is Initialization），或称 RAII，
它将必须在使用前请求的资源的生命周期与一个对象的生命周期相绑定。
</p>

<p>
将每个资源封装入一个类，其中
</p>

<p>
1, 构造函数请求资源，并建立所有类不变式，或在它无法完成时抛出异常，
</p>

<p>
2, 析构函数释放资源并决不抛出异常；
</p>

<p>
始终经由 RAII 类的实例使用满足要求的资源，该资源
</p>

<p>
1, 自身拥有自动存储期或临时生存期，
</p>

<p>
2, 具有与自动或临时对象的生存期绑定的生存期
</p>

<p>
移动语义使得在对象间，跨作用域，以及在线程内外安全地移动所有权，而同时维护资源安全成为可能。
</p>

<p>
拥有 open()/close()、lock()/unlock()，或 init()/copyFrom()/destroy() 成员函数的类是非 RAII 类的典型的例子
</p>
</div>
</div>

<div id="outline-container-org1976838" class="outline-4">
<h4 id="org1976838"><span class="section-number-4">3.3.2</span> lock_guard, unique_lock and scoped_lock</h4>
<div class="outline-text-4" id="text-3-3-2">
<div class="org-src-container">
<pre class="src src-c++">std::scoped_lock lock(e1.m, e2.m);

// 等价代码 1 （用 std::lock 和 std::lock_guard ）
// std::lock(e1.m, e2.m);
// std::lock_guard&lt;std::mutex&gt; lk1(e1.m, std::adopt_lock);
// std::lock_guard&lt;std::mutex&gt; lk2(e2.m, std::adopt_lock);

// 等价代码 2 （若需要 unique_lock ，例如对于条件变量）
// std::unique_lock&lt;std::mutex&gt; lk1(e1.m, std::defer_lock);
// std::unique_lock&lt;std::mutex&gt; lk2(e2.m, std::defer_lock);
// std::lock(lk1, lk2);
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org5469694" class="outline-3">
<h3 id="org5469694"><span class="section-number-3">3.4</span> condition_variable</h3>
<div class="outline-text-3" id="text-3-4">
<p>
notify_one(): notifies one waiting thread
</p>

<p>
notify_all(): notifies all waiting threads
</p>
</div>
</div>
</div>

<div id="outline-container-org3006216" class="outline-2">
<h2 id="org3006216"><span class="section-number-2">4</span> complier</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-org5d5b9fd" class="outline-3">
<h3 id="org5d5b9fd"><span class="section-number-3">4.1</span> install clang-12</h3>
<div class="outline-text-3" id="text-4-1">
<p>
<a href="https://apt.llvm.org/">https://apt.llvm.org/</a>
</p>
<div class="org-src-container">
<pre class="src src-sh">wget https://apt.llvm.org/llvm.sh
chmod +x llvm.sh
sudo ./llvm.sh &lt;version number&gt;
#+end_src sh
#+begin_src sh
sudo update-alternatives --config clang
cd /usr/bin
sudo ln -s clang-12 clang
sudo ln -s clang++-12 clang++
sudo ln -s /usr/bin/llvm-ar-12 /usr/bin/llvm-ar
sudo ln -s /usr/bin/llvm-as-12 /usr/bin/llvm-as
sudo ln -s /usr/bin/clangd-12 /usr/bin/clangd
sudo ln -s /usr/bin/clang-tidy-12 /usr/bin/clang-tidy

alias clang++='clang++ -std=c++20'
</pre>
</div>
</div>
</div>
