posts/2021-01-30-c++-note.org
** install gcc-10

#+begin_src sh

sudo apt install software-properties-common
sudo add-apt-repository ppa:ubuntu-toolchain-r/test
sudo apt install gcc-10 g++-10

sudo update-alternatives \
--install /usr/bin/gcc gcc /usr/bin/gcc-10 100 \
--slave /usr/bin/g++ g++ /usr/bin/g++-10 \
--slave /usr/bin/gcov gcov /usr/bin/gcov-10

# /usr/bin/gcc -> /etc/alternatives/gcc -> /usr/bin/gcc-10
sudo update-alternatives --config gcc

alias g++='g++ -std=c++20'

#+end_src

** gcc
+ -E :: 预处理 将 .c 文件转为 .i 
+ -S :: 编译 将 .i 文件转为 .s
+ -c :: 汇编 将 .s 文件转为 .o
+  :: 连接 将 .o 文件转为可执行文件

* gdb

set print asm-demangle on

set print demangle on

* miscellaneous
** value semantics
[[https://akrzemi1.wordpress.com/2012/02/03/value-semantics/][Value semantics]]

对一个具有值语义的原始变量变量赋值可以转换成内存的bit-wise-copy。

如果一个type X 具有值语义, 则：

1）X 的size在编译时可以确定。

2）将X的变量x,赋值与另一个变量y，无须专门的 = operator,简单的bit-wise-copy 即可。

3）当上述赋值发生后，x和y脱离关系：x和y可以独立销毁，其内存也可以独立释放。

* design patterns
** creational patterns
*** abstract factory
* Primer C++
** string, vector and array
#+begin_quote
"Some compilers may require the old-style declarations for a vector of vectors, for example, vector<vector<int> >."
#+end_quote

#+begin_quote
"The subscript operator on vector (and string) fetches an existing element; it does not add an element."
#+end_quote

* CSAPP
** basic
*** array and pointer
int *A2[3]: 3个指向 int 的指针，sizeof = 24 (= int *(A2[3]))

int (*A3)[3]: 一个指向长度为3的 int 数组的指针，sizeof = 8

*** registers
eax: accumulate

ecx: counter

edx: data

ebx: base

esi: source index -- second argument register

edi: destination index -- first argument register

esp: stack pointer

ebp: base pointer

eip: instruction pointer


CF: carry flag(for unsigned)

ZF: zero flag

SF: sign flag(for signed)

OF: overflow flag(for signed)

arguments 1,2,3,4,5,6 分别放在 rdi, rsi, rdx, rcx, r8, r9

浮点类型的参数是由另外一组寄存器传递的

return value 放在 rax
*** overflow buffer
1, randomize stack position

2, make the stack not executable

3, use stack canary
** asm
*** conditional move
使用 conditional moves 能避免 branch prediction. 

Branches are very disruptive to instruction flow through pipelines.

** lab
*** data lab
#+begin_src c++
/*
 * conditional - same as x ? y : z
 *   Example: conditional(2,4,5) = 4
 *   Legal ops: ! ~ & ^ | + << >>
 *   Max ops: 16
 *   Rating: 3
 */
int conditional(int x, int y, int z) {
// ~!x + 1: 当x为0时为全1，当x不为0时为全0
  return (~(~!x + 1) & y) | ((~!x + 1) & z);
}
#+end_src

#+begin_src c++
/*
 * floatScale2 - Return bit-level equivalent of expression 2*f for
 *   floating point argument f.
 *   Both the argument and result are passed as unsigned int's, but
 *   they are to be interpreted as the bit-level representation of
 *   single-precision floating point values.
 *   When argument is NaN, return argument
 *   Legal ops: Any integer/unsigned operations incl. ||, &&. also if, while
 *   Max ops: 30
 *   Rating: 4
 */
unsigned floatScale2(unsigned uf) {
  int exp = (uf >> 23) & 0xFF;
  // Special
  if (exp == 0xFF)
    return uf;
  // Denormalized
  if (exp == 0)
    return ((uf & 0x007fffff) << 1) | (uf & (1 << 31));
  // Normalized
  return uf + (1 << 23);
}
#+end_src

#+begin_src c++
/*
 * floatFloat2Int - Return bit-level equivalent of expression (int) f
 *   for floating point argument f.
 *   Argument is passed as unsigned int, but
 *   it is to be interpreted as the bit-level representation of a
 *   single-precision floating point value.
 *   Anything out of range (including NaN and infinity) should return
 *   0x80000000u.
 *   Legal ops: Any integer/unsigned operations incl. ||, &&. also if, while
 *   Max ops: 30
 *   Rating: 4
 */
int floatFloat2Int(unsigned uf) {
  int TMIN = 1 << 31;
  int exp = ((uf >> 23) & 0xFF) - 127;
  // Out of range
  if (exp > 31)
    return TMIN;
  if (exp < 0)
    return 0;
  int frac = (uf & 0x007fffff) | 0x00800000;
  // Left shift or right shift
  int f = (exp > 23) ? (frac << (exp - 23)) : (frac >> (23 - exp));
  // Sign
  return (uf & TMIN) ? -f : f;
}
#+end_src
*** bomb lab

* Practical Network Programming
** intro
*** layered network
ethernet frame

IP packet

TCP segment

Application message

* UNIX Network Programming
