2021-01-30-c++-note.html

<div id="outline-container-org43f5fd0" class="outline-3">
<h3 id="org43f5fd0"><span class="section-number-3">4.2</span> install gcc-10</h3>
<div class="outline-text-3" id="text-4-2">
<div class="org-src-container">
<pre class="src src-sh">
sudo apt install software-properties-common
sudo add-apt-repository ppa:ubuntu-toolchain-r/test
sudo apt install gcc-10 g++-10

sudo update-alternatives \
--install /usr/bin/gcc gcc /usr/bin/gcc-10 100 \
--slave /usr/bin/g++ g++ /usr/bin/g++-10 \
--slave /usr/bin/gcov gcov /usr/bin/gcov-10

# /usr/bin/gcc -&gt; /etc/alternatives/gcc -&gt; /usr/bin/gcc-10
sudo update-alternatives --config gcc

alias g++='g++ -std=c++20'

</pre>
</div>
</div>
</div>

<div id="outline-container-org84a6024" class="outline-3">
<h3 id="org84a6024"><span class="section-number-3">4.3</span> gcc</h3>
<div class="outline-text-3" id="text-4-3">
<dl class="org-dl">
<dt>-E</dt><dd>预处理 将 .c 文件转为 .i</dd>
<dt>-S</dt><dd>编译 将 .i 文件转为 .s</dd>
<dt>-c</dt><dd>汇编 将 .s 文件转为 .o</dd>
<dt>(no term)</dt><dd>:: 连接 将 .o 文件转为可执行文件</dd>
</dl>
</div>
</div>
</div>

<div id="outline-container-org733aecc" class="outline-2">
<h2 id="org733aecc"><span class="section-number-2">5</span> gdb</h2>
<div class="outline-text-2" id="text-5">
<p>
set print asm-demangle on
</p>

<p>
set print demangle on
</p>
</div>
</div>

<div id="outline-container-org8f6c997" class="outline-2">
<h2 id="org8f6c997"><span class="section-number-2">6</span> miscellaneous</h2>
<div class="outline-text-2" id="text-6">
</div>
<div id="outline-container-orgd1451a5" class="outline-3">
<h3 id="orgd1451a5"><span class="section-number-3">6.1</span> value semantics</h3>
<div class="outline-text-3" id="text-6-1">
<p>
<a href="https://akrzemi1.wordpress.com/2012/02/03/value-semantics/">Value semantics</a>
</p>

<p>
对一个具有值语义的原始变量变量赋值可以转换成内存的bit-wise-copy。
</p>

<p>
如果一个type X 具有值语义, 则：
</p>

<p>
1）X 的size在编译时可以确定。
</p>

<p>
2）将X的变量x,赋值与另一个变量y，无须专门的 = operator,简单的bit-wise-copy 即可。
</p>

<p>
3）当上述赋值发生后，x和y脱离关系：x和y可以独立销毁，其内存也可以独立释放。
</p>
</div>
</div>
</div>

<div id="outline-container-org328459a" class="outline-2">
<h2 id="org328459a"><span class="section-number-2">7</span> design patterns</h2>
<div class="outline-text-2" id="text-7">
</div>
<div id="outline-container-org47eb07f" class="outline-3">
<h3 id="org47eb07f"><span class="section-number-3">7.1</span> creational patterns</h3>
<div class="outline-text-3" id="text-7-1">
</div>
<div id="outline-container-orgc825713" class="outline-4">
<h4 id="orgc825713"><span class="section-number-4">7.1.1</span> abstract factory</h4>
</div>
</div>
</div>
<div id="outline-container-org1f95517" class="outline-2">
<h2 id="org1f95517"><span class="section-number-2">8</span> Primer C++</h2>
<div class="outline-text-2" id="text-8">
</div>
<div id="outline-container-org9f1fb5f" class="outline-3">
<h3 id="org9f1fb5f"><span class="section-number-3">8.1</span> string, vector and array</h3>
<div class="outline-text-3" id="text-8-1">
<blockquote>
<p>
"Some compilers may require the old-style declarations for a vector of vectors, for example, vector&lt;vector&lt;int&gt; &gt;."
</p>
</blockquote>

<blockquote>
<p>
"The subscript operator on vector (and string) fetches an existing element; it does not add an element."
</p>
</blockquote>
</div>
</div>
</div>

<div id="outline-container-org7f2f410" class="outline-2">
<h2 id="org7f2f410"><span class="section-number-2">9</span> CSAPP</h2>
<div class="outline-text-2" id="text-9">
</div>
<div id="outline-container-org9541bd9" class="outline-3">
<h3 id="org9541bd9"><span class="section-number-3">9.1</span> basic</h3>
<div class="outline-text-3" id="text-9-1">
</div>
<div id="outline-container-orga4fb1f3" class="outline-4">
<h4 id="orga4fb1f3"><span class="section-number-4">9.1.1</span> array and pointer</h4>
<div class="outline-text-4" id="text-9-1-1">
<p>
int *A2[3]: 3个指向 int 的指针，sizeof = 24 (= int *(A2[3]))
</p>

<p>
int (*A3)[3]: 一个指向长度为3的 int 数组的指针，sizeof = 8
</p>
</div>
</div>

<div id="outline-container-orgad4a9d8" class="outline-4">
<h4 id="orgad4a9d8"><span class="section-number-4">9.1.2</span> registers</h4>
<div class="outline-text-4" id="text-9-1-2">
<p>
eax: accumulate
</p>

<p>
ecx: counter
</p>

<p>
edx: data
</p>

<p>
ebx: base
</p>

<p>
esi: source index &#x2013; second argument register
</p>

<p>
edi: destination index &#x2013; first argument register
</p>

<p>
esp: stack pointer
</p>

<p>
ebp: base pointer
</p>

<p>
eip: instruction pointer
</p>


<p>
CF: carry flag(for unsigned)
</p>

<p>
ZF: zero flag
</p>

<p>
SF: sign flag(for signed)
</p>

<p>
OF: overflow flag(for signed)
</p>

<p>
arguments 1,2,3,4,5,6 分别放在 rdi, rsi, rdx, rcx, r8, r9
</p>

<p>
浮点类型的参数是由另外一组寄存器传递的
</p>

<p>
return value 放在 rax
</p>
</div>
</div>
<div id="outline-container-org5cb5356" class="outline-4">
<h4 id="org5cb5356"><span class="section-number-4">9.1.3</span> overflow buffer</h4>
<div class="outline-text-4" id="text-9-1-3">
<p>
1, randomize stack position
</p>

<p>
2, make the stack not executable
</p>

<p>
3, use stack canary
</p>
</div>
</div>
</div>
<div id="outline-container-orgff83253" class="outline-3">
<h3 id="orgff83253"><span class="section-number-3">9.2</span> asm</h3>
<div class="outline-text-3" id="text-9-2">
</div>
<div id="outline-container-orgc8c1ad6" class="outline-4">
<h4 id="orgc8c1ad6"><span class="section-number-4">9.2.1</span> conditional move</h4>
<div class="outline-text-4" id="text-9-2-1">
<p>
使用 conditional moves 能避免 branch prediction. 
</p>

<p>
Branches are very disruptive to instruction flow through pipelines.
</p>
</div>
</div>
</div>

<div id="outline-container-org6b34733" class="outline-3">
<h3 id="org6b34733"><span class="section-number-3">9.3</span> lab</h3>
<div class="outline-text-3" id="text-9-3">
</div>
<div id="outline-container-org7a16a5c" class="outline-4">
<h4 id="org7a16a5c"><span class="section-number-4">9.3.1</span> data lab</h4>
<div class="outline-text-4" id="text-9-3-1">
<div class="org-src-container">
<pre class="src src-c++">/*
 * conditional - same as x ? y : z
 *   Example: conditional(2,4,5) = 4
 *   Legal ops: ! ~ &amp; ^ | + &lt;&lt; &gt;&gt;
 *   Max ops: 16
 *   Rating: 3
 */
int conditional(int x, int y, int z) {
// ~!x + 1: 当x为0时为全1，当x不为0时为全0
  return (~(~!x + 1) &amp; y) | ((~!x + 1) &amp; z);
}
</pre>
</div>

<div class="org-src-container">
<pre class="src src-c++">/*
 * floatScale2 - Return bit-level equivalent of expression 2*f for
 *   floating point argument f.
 *   Both the argument and result are passed as unsigned int's, but
 *   they are to be interpreted as the bit-level representation of
 *   single-precision floating point values.
 *   When argument is NaN, return argument
 *   Legal ops: Any integer/unsigned operations incl. ||, &amp;&amp;. also if, while
 *   Max ops: 30
 *   Rating: 4
 */
unsigned floatScale2(unsigned uf) {
  int exp = (uf &gt;&gt; 23) &amp; 0xFF;
  // Special
  if (exp == 0xFF)
    return uf;
  // Denormalized
  if (exp == 0)
    return ((uf &amp; 0x007fffff) &lt;&lt; 1) | (uf &amp; (1 &lt;&lt; 31));
  // Normalized
  return uf + (1 &lt;&lt; 23);
}
</pre>
</div>

<div class="org-src-container">
<pre class="src src-c++">/*
 * floatFloat2Int - Return bit-level equivalent of expression (int) f
 *   for floating point argument f.
 *   Argument is passed as unsigned int, but
 *   it is to be interpreted as the bit-level representation of a
 *   single-precision floating point value.
 *   Anything out of range (including NaN and infinity) should return
 *   0x80000000u.
 *   Legal ops: Any integer/unsigned operations incl. ||, &amp;&amp;. also if, while
 *   Max ops: 30
 *   Rating: 4
 */
int floatFloat2Int(unsigned uf) {
  int TMIN = 1 &lt;&lt; 31;
  int exp = ((uf &gt;&gt; 23) &amp; 0xFF) - 127;
  // Out of range
  if (exp &gt; 31)
    return TMIN;
  if (exp &lt; 0)
    return 0;
  int frac = (uf &amp; 0x007fffff) | 0x00800000;
  // Left shift or right shift
  int f = (exp &gt; 23) ? (frac &lt;&lt; (exp - 23)) : (frac &gt;&gt; (23 - exp));
  // Sign
  return (uf &amp; TMIN) ? -f : f;
}
</pre>
</div>
</div>
</div>
<div id="outline-container-org9aa0df3" class="outline-4">
<h4 id="org9aa0df3"><span class="section-number-4">9.3.2</span> bomb lab</h4>
</div>
</div>
</div>

<div id="outline-container-orgb67a3da" class="outline-2">
<h2 id="orgb67a3da"><span class="section-number-2">10</span> Practical Network Programming</h2>
<div class="outline-text-2" id="text-10">
</div>
<div id="outline-container-org3ffb5c8" class="outline-3">
<h3 id="org3ffb5c8"><span class="section-number-3">10.1</span> intro</h3>
<div class="outline-text-3" id="text-10-1">
</div>
<div id="outline-container-orgf2a2faa" class="outline-4">
<h4 id="orgf2a2faa"><span class="section-number-4">10.1.1</span> layered network</h4>
<div class="outline-text-4" id="text-10-1-1">
<p>
ethernet frame
</p>

<p>
IP packet
</p>

<p>
TCP segment
</p>

<p>
Application message
</p>
</div>
</div>
</div>
</div>

<div id="outline-container-org8779366" class="outline-2">
<h2 id="org8779366"><span class="section-number-2">11</span> UNIX Network Programming</h2>
</div>
<div class="taglist"><a href="https://zhongming-unice.github.io/tags.html">Tags</a>: <a href="https://zhongming-unice.github.io/tag-c++.html">c++</a> </div></div>
<div id="postamble" class="status"></div>
</body>
</html>
